## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 6 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "739580681" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4",
              ~ (known after apply),
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.cartography_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_policies"  {
      ~ id      = "646190638" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::996667111599:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::955148791056:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::925306372402:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::902343555465:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::894242006032:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::820252213580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::805525519938:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::722713121070:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::595701125956:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::537819865265:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::515018049985:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::473697194269:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::406214159830:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::400061975867:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::349837941862:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::160411545784:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::136676205420:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::059208818674:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::005133826942:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      ~ id       = "e84e350857c6fab76936aad0ce5f258c354626f8f4d61aec8eb5290e5d40edcf" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts" = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                = {
                      - End            = true
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - CapacityProviderStrategy = [
                                          - {
                                              - Base             = 1
                                              - CapacityProvider = "FARGATE_SPOT"
                                              - Weight           = 5
                                            },
                                          - {
                                              - Base             = 0
                                              - CapacityProvider = "FARGATE"
                                              - Weight           = 1
                                            },
                                        ]
                                      - Cluster                  = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - NetworkConfiguration     = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides                = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition           = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - ErrorEquals     = [
                                              - "States.TaskFailed",
                                            ]
                                          - IntervalSeconds = 120
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
      ~ template = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "Get AWS accounts",
              "States": {
                "Get AWS accounts": {
                  "Type": "Task",
                  "Next": "Map",
                  "Parameters": {
                    "Name": "/cartography/asset_inventory_account_list"
                  },
                  "Resource": "arn:aws:states:::aws-sdk:ssm:getParameter",
                  "ResultSelector": {
                    "accounts.$": "States.StringToJson($.Parameter.Value)"
                  }
                },
                "Map": {
                  "Type": "Map",
                  "Iterator": {
                    "StartAt": "Pass",
                    "States": {
                      "Pass": {
                        "Type": "Pass",
                        "Next": "Cartography",
                        "Parameters": {
                          "account.$": "$"
                        }
                      },
                      "Cartography": {
                        "Type": "Task",
                        "Resource": "arn:aws:states:::ecs:runTask.sync",
                        "Parameters": {
                          "Cluster": "${CARTOGRAPHY_CLUSTER}",
                          "CapacityProviderStrategy": [
                            {
                              "Base": ${MIN_ECS_CAPACITY},
                              "CapacityProvider": "FARGATE_SPOT",
                              "Weight": ${MAX_ECS_CAPACITY}
                            },
                            {
                              "Base": 0,
                              "CapacityProvider": "FARGATE",
                              "Weight": ${MIN_ECS_CAPACITY}
                            }
                          ],
                          "TaskDefinition": "${CARTOGRAPHY_TASK_DEF}",
                          "Overrides": {
                            "ContainerOverrides": [
                              {
                                "Name": "${CARTOGRAPHY_SERVICE_NAME}",
                                "Environment": [
                                  {
                                    "Name": "AWS_ACCOUNT",
                                    "Value.$": "$.account"
                                  },
                                  {
                                    "Name": "AWS_CONFIG_FILE",
                                    "Value": "/config/role_config"
                                  },
                                  {
                                    "Name": "NEO4J_URI",
                                    "Value": "bolt://neo4j.internal.local:7687"
                                  },
                                  {
                                    "Name": "NEO4J_USER",
                                    "Value": "neo4j"
                                  }
                                ]
                              }
                            ]
                          },
                          "NetworkConfiguration": {
                            "AwsvpcConfiguration": {
                              "SecurityGroups": ["${SECURITY_GROUPS}"],
                              "Subnets":[${SUBNETS}]
                            }
                          }
                        },
                        "Retry": [
                          {
                            "ErrorEquals": ["States.TaskFailed"],
                            "IntervalSeconds": 120,
                            "MaxAttempts": 4
                          }
                        ],
                        "End": true
                      }
                    }
                  },
                  "MaxConcurrency": 1,
                  "ItemsPath": "$.accounts",
                  "ResultPath": null,
          +       "Next": "Neo4J Sentinel Forwarder"
          +     },
          +     "Neo4J Sentinel Forwarder" : {
          +       "Type" : "Task",
          +       "Resource" : "arn:aws:states:::lambda:invoke",
          +       "Parameters" : {
          +         "FunctionName" : "${NEO4J_SENTINEL_FORWARDER_LAMBDA}"
          +       },
          +       "Retry" : [
          +         {
          +           "ErrorEquals" : [
          +             "Lambda.ServiceException",
          +             "Lambda.AWSLambdaException",
          +             "Lambda.SdkClientException"
          +           ],
          +           "IntervalSeconds" : 2,
          +           "MaxAttempts" : 6,
          +           "BackoffRate" : 2
          +         }
          +       ],
                  "End": true
                }
              }
            }
        EOT
      ~ vars     = {
          ~ "CARTOGRAPHY_TASK_DEF"     = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4" -> (known after apply)
            # (6 unchanged elements hidden)
        }
    }

  # data.template_file.cartography_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cartography_container_definition"  {
      ~ id       = "0c6988e8d3a76eccd6be98c8c2405621410e9ce14f9910553e73910ba34c4af0" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "AWS_CONFIG_FILE"
                          - value = "/config/role_config"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cartography"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cartography-task"
                        }
                    }
                  - name             = "cartography"
                  - portMappings     = [
                      - {
                          - ContainerPort = 443
                          - Protocol      = "tcp"
                          - hostPort      = 443
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          + "NEO4J_SENTINEL_FORWARDER_LAMBDA" = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder:$LATEST"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_event_rule.asset_inventory_cartography will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "asset_inventory_cartography" {
        id                  = "cartography"
      ~ is_enabled          = false -> true
        name                = "cartography"
        tags                = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.cartography must be replaced
-/+ resource "aws_ecs_task_definition" "cartography" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_CONFIG_FILE"
                          - value = "/config/role_config"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cartography"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cartography-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cartography"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "cartography" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be updated in-place
  ~ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
        id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECSLambda"
        name      = "CartographyStateMachineECSLambda"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
          ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
